---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructure.Dispose
source: html/20914736-3ee9-d59f-27da-58468ea9d05c.htm
---
# Autodesk.Revit.DB.CompoundStructure.Dispose Method

Releases all resources used by the CompoundStructure

## Syntax (C#)
```csharp
public void Dispose()
```